## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
cloudflare_record.mx-2: Refreshing state... [id=faafcadfad83b1236f4c929db14f3d18]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
cloudflare_record._autodiscover_tcp: Refreshing state... [id=152e2e33d0bd2d72dfa140bb525f829f]
cloudflare_record.www-aaaa: Refreshing state... [id=42ee94b3fab962b8b21d1487ec734fbd]
cloudflare_record.mail: Refreshing state... [id=f9cff3da6c43997e0e9eacaac8fbb589]
cloudflare_record.imap: Refreshing state... [id=ac6aeafd9af224e07c88efdc9b5e4887]
cloudflare_record.autoconfig: Refreshing state... [id=db6141ae25d9723d0cd72ff53df130e7]
cloudflare_record.mx-1: Refreshing state... [id=7f7e451868fc1ffe53a7de678eb3bc93]
cloudflare_record.mail2: Refreshing state... [id=60581cadb658f04d4d94bae9c8bfbbae]
cloudflare_record.pop3: Refreshing state... [id=82cb3cd742c7d05bc2d03f25c59c82c3]
cloudflare_record.webbmail: Refreshing state... [id=103b1308497abba1cb8bcc4af7c5264f]
cloudflare_record.root-aaaa: Refreshing state... [id=5c120446a4bc1a2fb3eb480206844313]
cloudflare_record.smtp: Refreshing state... [id=5f6a7752e884e3c824aae558732f2fd0]
cloudflare_record.www-a: Refreshing state... [id=5d3ab468a74e6757b07c36226406b661]
cloudflare_record.webmail: Refreshing state... [id=457b0a51b6b0d9041801788e0dfd917f]
cloudflare_record.root-a: Refreshing state... [id=9baadb4a0bef6e6e9e3fa50ab2bfe2c1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.node1 will be created
  + resource "hcloud_server" "node1" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-11"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "hel1"
      + name                       = "node1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + status                     = (known after apply)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*